Revit 2024 API
SelectionChangedEventArgs Class
 The event arguments used by the SelectionChanged event.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class SelectionChangedEventArgs : RevitAPISingleEventArgs
Visual Basic
Public Class SelectionChangedEventArgs _
	Inherits RevitAPISingleEventArgs
Visual C++
public ref class SelectionChangedEventArgs : public RevitAPISingleEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.SelectionChangedEventArgs
See Also
SelectionChangedEventArgs Members
Autodesk.Revit.UI.Events Namespace